---
kind: property
id: P:Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotApplySplitWithGap
source: html/c0f478ba-3f38-fded-a0e9-6eb1047420b5.htm
---
# Autodesk.Revit.DB.BuiltInFailures.FamilyFailures.CannotApplySplitWithGap Property

Can't make structural element.

## Syntax (C#)
```csharp
public static FailureDefinitionId CannotApplySplitWithGap { get; }
```